In [14]:
import pandas as pd

In [15]:
df = pd.read_csv("D:\\ITI\\Python\\ITI_Python_for_Data_Management\\Extraction\\landing\\order_items.csv")
df.head(10)

,order_id,item_id,product_id,quantity,list_price,discount,Extraction_Date,source
0,1,1,20,1,599.99,0.20,1.714563e+09,SQL-Server
1,1,2,8,2,1799.99,0.07,1.714563e+09,SQL-Server
2,1,3,10,2,1549.00,0.05,1.714563e+09,SQL-Server
3,1,4,16,2,599.99,0.05,1.714563e+09,SQL-Server
4,1,5,4,1,2899.99,0.20,1.714563e+09,SQL-Server
5,2,1,20,1,599.99,0.07,1.714563e+09,SQL-Server
6,2,2,16,2,599.99,0.05,1.714563e+09,SQL-Server
7,3,1,3,1,999.99,0.05,1.714563e+09,SQL-Server
8,3,2,20,1,599.99,0.05,1.714563e+09,SQL-Server
9,4,1,2,2,749.99,0.10,1.714563e+09,SQL-Server

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4764 entries, 0 to 4763
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         4764 non-null   int64
 1   item_id          4764 non-null   object
 2   product_id       4764 non-null   int64
 3   quantity         4764 non-null   int64
 4   list_price       4764 non-null   float64
 5   discount         4764 non-null   float64
 6   Extraction_Date  4764 non-null   float64
 7   source           4764 non-null   object
dtypes: float64(3), int64(3), object(2)
memory usage: 297.9+ KB

# Data Cleansing

In [17]:
# Replace non-numeric values with NaN
df['item_id'] = pd.to_numeric(df['item_id'], errors='coerce')

# Convert to integers, NaN values will become missing integers
df['item_id'] = df['item_id'].astype('Int64')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4764 entries, 0 to 4763
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         4764 non-null   int64
 1   item_id          4760 non-null   Int64
 2   product_id       4764 non-null   int64
 3   quantity         4764 non-null   int64
 4   list_price       4764 non-null   float64
 5   discount         4764 non-null   float64
 6   Extraction_Date  4764 non-null   float64
 7   source           4764 non-null   object
dtypes: Int64(1), float64(3), int64(3), object(1)
memory usage: 302.5+ KB

In [19]:
df.shape

(4764, 8)

In [20]:
# Get the that that fall in the valid range 
filtered_df = df[(df['list_price'] >= 200) & (df['list_price'] <= 1000)]
filtered_df.shape

(3184, 8)

In [21]:
type(filtered_df)

pandas.core.frame.DataFrame

In [22]:
# check for Missing data
filtered_df.isna().sum()

order_id           0
item_id            3
product_id         0
quantity           0
list_price         0
discount           0
Extraction_Date    0
source             0
dtype: int64

In [23]:
filtered_df.dropna(inplace=True)

C:\Users\Abdelrahman\AppData\Local\Temp\ipykernel_8856\724713040.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df.dropna(inplace=True)

In [24]:
filtered_df.shape

(3181, 8)

In [25]:
filtered_df.isna().sum()

order_id           0
item_id            0
product_id         0
quantity           0
list_price         0
discount           0
Extraction_Date    0
source             0
dtype: int64

In [26]:
filtered_df['Extraction_Date'] = pd.to_datetime(filtered_df['Extraction_Date'], unit='s')
filtered_df.head()

C:\Users\Abdelrahman\AppData\Local\Temp\ipykernel_8856\2410306567.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df['Extraction_Date'] = pd.to_datetime(filtered_df['Extraction_Date'], unit='s')

,order_id,item_id,product_id,quantity,list_price,discount,Extraction_Date,source
0,1,1,20,1,599.99,0.20,2024-05-01 11:37:45.450598001,SQL-Server
3,1,4,16,2,599.99,0.05,2024-05-01 11:37:45.450598001,SQL-Server
5,2,1,20,1,599.99,0.07,2024-05-01 11:37:45.450598001,SQL-Server
6,2,2,16,2,599.99,0.05,2024-05-01 11:37:45.450598001,SQL-Server
7,3,1,3,1,999.99,0.05,2024-05-01 11:37:45.450598001,SQL-Server

In [27]:
filtered_df.to_csv("D:\\ITI\\Python\\ITI_Python_for_Data_Management\\Extraction\\Staging\\order_items\\order_items.csv")